Autodesk.Revit.DB.FaceDetailNode.GetInstanceTransform
Returns instance transform of the object being drawn.
Since:
2020

Autodesk.Revit.DB.FaceDetailNode.GetLinkTransform
Returns link transform of the object being drawn.
Since:
2020

Autodesk.Revit.DB.FaceDetailNode.LineProperties
Access to the line (pen) properties of the curve being drawn.
Since:
2020

Autodesk.Revit.DB.FaceDetailNode
A base class of output nodes that represent face edges and face silhouettes.
Since:
2020